tests/load-testing/endurance-test.yml
# Artillery Endurance Test Configuration
#
# Long-running test to identify memory leaks, resource exhaustion, and
# performance degradation over extended periods.

config:
  target: "http://localhost:8787"
  phases:
    # Extended sustained load for 10 minutes
    - duration: 600
      arrivalRate: 15
      name: "Endurance test"

  ensure:
    p95: 250
    p99: 500
    maxErrorRate: 3

scenarios:
  - name: "Endurance user session"
    weight: 70
    flow:
      # Typical user behavior over extended period
      - get:
          url: "/api/categories"
          name: "Browse categories"

      - get:
          url: "/api/listings?q={{ $pick(['phone', 'laptop', 'car', 'bike', 'book']) }}"
          name: "Search items"

      - get:
          url: "/api/listings/{{ $randomString() }}"
          name: "View random listing"
          expect:
            - statusCode: [200, 404]

      - think: 5

  - name: "Authenticated endurance session"
    weight: 30
    flow:
      # Authenticated user doing various operations
      - post:
          url: "/api/dev/auth"
          json:
            telegramId: "{{ $randomInt(100000, 999999) }}"
          capture:
            - json: "$.token"
              as: "token"

      - get:
          url: "/api/me"
          headers:
            Authorization: "Bearer {{ token }}"

      - get:
          url: "/api/me/listings"
          headers:
            Authorization: "Bearer {{ token }}"

      - think: 8