tests/load-testing/spike-test.yml
# Artillery Spike Test Configuration
#
# Tests system behavior under sudden load spikes to ensure graceful handling
# of traffic bursts and quick recovery.

config:
  target: "http://localhost:8787"
  phases:
    # Normal baseline load
    - duration: 60
      arrivalRate: 10
      name: "Baseline"

    # Sudden spike
    - duration: 30
      arrivalRate: 200
      name: "Traffic spike"

    # Return to normal
    - duration: 60
      arrivalRate: 10
      name: "Recovery"

  ensure:
    p95: 500  # Allow higher latency during spike
    maxErrorRate: 10  # Allow some errors during extreme load

scenarios:
  - name: "Spike test user journey"
    flow:
      # Quick user actions that might happen during traffic spikes
      - get:
          url: "/api/categories"
          name: "Quick categories"

      - get:
          url: "/api/listings?limit=10"
          name: "Quick search"

      - think: 0.5  # Minimal think time during spike